In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:anayak_98@localhost:3306/apndatabase

1. Retrieve the names and email addresses of all users.

In [3]:
%sql SELECT name, email_address FROM amazon_prime ORDER BY name LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[('Aaron Goodman', 'michaelanderson@example.org'),
 ('Aaron Guzman', 'dawnwilliamson@example.org'),
 ('Aaron Wilson', 'afisher@example.com'),
 ('Abigail Boone', 'dsnyder@example.com'),
 ('Abigail Carroll', 'bking@example.org'),
 ('Abigail Nichols', 'michaelgreen@example.net'),
 ('Adam Harris', 'nelsonjoseph@example.com'),
 ('Adam Lopez', 'stevenallen@example.net'),
 ('Adam Mendoza', 'anthony42@example.org'),
 ('Adam Miller', 'tduffy@example.net')]

2. Find the number of users by gender.

In [4]:
%sql SELECT gender, COUNT(*) AS total_users FROM amazon_prime GROUP BY gender;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
2 rows affected.

[('Male', 1260), ('Female', 1240)]

3. Get the usernames and membership start dates of users who joined before a certain date (2024-03-13).

In [5]:
%sql SELECT username, membership_start_date FROM amazon_prime WHERE membership_start_date < '2024-03-13' ORDER BY membership_start_date LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[('housejames', datetime.datetime(2024, 1, 1, 0, 0)),
 ('smithdouglas', datetime.datetime(2024, 1, 1, 0, 0)),
 ('robert75', datetime.datetime(2024, 1, 1, 0, 0)),
 ('vickieschneider', datetime.datetime(2024, 1, 1, 0, 0)),
 ('edwardsbrandon', datetime.datetime(2024, 1, 1, 0, 0)),
 ('cooleylisa', datetime.datetime(2024, 1, 1, 0, 0)),
 ('michele59', datetime.datetime(2024, 1, 1, 0, 0)),
 ('jenna92', datetime.datetime(2024, 1, 1, 0, 0)),
 ('villarrealsuzanne', datetime.datetime(2024, 1, 1, 0, 0)),
 ('kellylane', datetime.datetime(2024, 1, 1, 0, 0))]

4. Count the number of users from a specific location (let's say, locations that contains Port).

In [6]:
%%sql 
SELECT 
    location, COUNT(*) AS total_users 
FROM amazon_prime 
GROUP BY location 
HAVING location LIKE '%Port%' 
ORDER BY total_users DESC LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[('Port Jonathan', 3),
 ('Port John', 3),
 ('New Jenniferport', 2),
 ('Williamport', 2),
 ('Port Nicholas', 2),
 ('Port Anthony', 2),
 ('Port Markland', 2),
 ('Port Mark', 2),
 ('Port Michael', 2),
 ('Port James', 2)]

5. List the subscription plans along with the count of users subscribed to each plan.

In [7]:
%%sql 
SELECT
    subscription_plan, COUNT(*) AS total_users 
FROM amazon_prime 
GROUP BY subscription_plan 
ORDER BY total_users DESC;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
2 rows affected.

[('Annual', 1271), ('Monthly', 1229)]

6. Find the usernames and their corresponding payment information.

In [8]:
%%sql 
SELECT username, 
    CASE 
        WHEN COUNT(DISTINCT payment_information) > 1 
        THEN GROUP_CONCAT(DISTINCT payment_information) 
        ELSE MAX(payment_information) END
    AS aggregated_payment_information 
FROM amazon_prime 
GROUP BY username 
HAVING COUNT(DISTINCT payment_information) > 1 
ORDER BY username;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
29 rows affected.

[('anthony39', 'Mastercard,Visa'),
 ('brian80', 'Amex,Mastercard'),
 ('bryandiaz', 'Amex,Visa'),
 ('david32', 'Mastercard,Visa'),
 ('dbailey', 'Mastercard,Visa'),
 ('djohnson', 'Amex,Mastercard'),
 ('esmith', 'Mastercard,Visa'),
 ('ewilson', 'Amex,Mastercard,Visa'),
 ('frodriguez', 'Amex,Mastercard'),
 ('jacqueline84', 'Amex,Visa'),
 ('jeremy97', 'Amex,Visa'),
 ('john96', 'Amex,Visa'),
 ('kblack', 'Mastercard,Visa'),
 ('michaellewis', 'Amex,Mastercard'),
 ('njohnson', 'Amex,Visa'),
 ('panderson', 'Amex,Mastercard'),
 ('robert10', 'Amex,Visa'),
 ('robert75', 'Amex,Mastercard'),
 ('rrobinson', 'Mastercard,Visa'),
 ('ttran', 'Amex,Mastercard'),
 ('twilliams', 'Amex,Mastercard'),
 ('ubrown', 'Amex,Mastercard'),
 ('uhall', 'Amex,Mastercard'),
 ('ujones', 'Amex,Mastercard'),
 ('usmith', 'Amex,Mastercard'),
 ('xcraig', 'Mastercard,Visa'),
 ('yjones', 'Mastercard,Visa'),
 ('ymartinez', 'Amex,Visa'),
 ('zwilson', 'Amex,Visa')]

7. Identify the renewal status of each user's subscription.

In [9]:
%%sql
SELECT username, renewal_status FROM amazon_prime ORDER BY renewal_status LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[('zpruitt', 'Auto-renew'),
 ('hancockjesus', 'Auto-renew'),
 ('umclaughlin', 'Auto-renew'),
 ('elizabeth31', 'Auto-renew'),
 ('pattersonalexandra', 'Auto-renew'),
 ('daniel24', 'Auto-renew'),
 ('michaellewis', 'Auto-renew'),
 ('williamsbenjamin', 'Auto-renew'),
 ('harringtonnicholas', 'Auto-renew'),
 ('jessica53', 'Auto-renew')]

8. Calculate the average usage frequency of all users.

In [10]:
%%sql

-- Define a mapping for usage frequency categories to numerical values
WITH usage_frequency_mapping AS (
    SELECT 'Frequent' AS category, 3 AS numeric_value
    UNION ALL
    SELECT 'Regular' AS category, 2 AS numeric_value
    UNION ALL
    SELECT 'Occasional' AS category, 1 AS numeric_value
)

-- Create a new column with numerical values based on the mapping
, mapped_data AS (
    SELECT df.*, um.numeric_value AS usage_frequency_numeric
    FROM amazon_prime df
    JOIN usage_frequency_mapping um ON df.usage_frequency = um.category
)

-- Calculate the average usage frequency
SELECT ROUND(AVG(usage_frequency_numeric), 2) AS average_usage_frequency
FROM mapped_data;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
1 rows affected.

[(Decimal('2.01'),)]

9. Determine the number of users with a specific purchase history (Clothing).

In [11]:
%%sql
SELECT COUNT(*) AS clothing_users FROM amazon_prime
WHERE purchase_history = 'Clothing';

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
1 rows affected.

[(802,)]

10. List the favorite genres of users along with the count of users for each genre.

In [12]:
%%sql
SELECT favorite_genres AS genre, COUNT(*) AS total_users
FROM amazon_prime
GROUP BY favorite_genres
ORDER BY total_users DESC;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
7 rows affected.

[('Horror', 383),
 ('Action', 380),
 ('Romance', 368),
 ('Drama', 361),
 ('Comedy', 349),
 ('Documentary', 340),
 ('Sci-Fi', 319)]

11. Retrieve the distinct devices used by users.

In [13]:
%%sql
SELECT DISTINCT devices_used FROM amazon_prime;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
3 rows affected.

[('Smart TV',), ('Smartphone',), ('Tablet',)]

12. Get the engagement metrics for users who gave feedback or ratings.

In [14]:
%%sql

SELECT user_id, engagement_metrics, feedback_ratings
FROM amazon_prime
WHERE feedback_ratings IS NOT NULL LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[(1, 'Medium', 3.6),
 (2, 'Medium', 3.8),
 (3, 'Low', 3.3),
 (4, 'High', 3.3),
 (5, 'Low', 4.3),
 (6, 'Low', 3.8),
 (7, 'Medium', 4.4),
 (8, 'Medium', 3.6),
 (9, 'Medium', 4.0),
 (10, 'High', 4.9)]

In [15]:
%%sql

WITH engagement_records AS (SELECT user_id, engagement_metrics as engagement, feedback_ratings as ratings
FROM amazon_prime
WHERE feedback_ratings IS NOT NULL)
SELECT engagement, ROUND(SUM(ratings), 2) AS sum_ratings, ROUND(AVG(ratings), 2) AS avg_ratings FROM engagement_records GROUP BY engagement;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
3 rows affected.

[('Medium', 3327.7, 3.99), ('Low', 3290.9, 4.01), ('High', 3393.3, 4.02)]

13. Find the usernames of users who had customer support interactions.

In [16]:
%%sql
SELECT username, customer_support_interactions
FROM amazon_prime
WHERE customer_support_interactions != 0 LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[('williamholland', 3),
 ('scott22', 7),
 ('brooke16', 8),
 ('elizabeth31', 7),
 ('pattersonalexandra', 1),
 ('gparks', 2),
 ('michaellewis', 10),
 ('adrienne49', 6),
 ('brittany02', 8),
 ('jessica53', 6)]

In [17]:
%%sql
WITH csi_records AS (SELECT username, customer_support_interactions
FROM amazon_prime
WHERE customer_support_interactions != 0)
SELECT customer_support_interactions, COUNT(username) AS total_users 
FROM csi_records
GROUP BY customer_support_interactions
ORDER BY customer_support_interactions;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[(1, 241),
 (2, 231),
 (3, 215),
 (4, 225),
 (5, 232),
 (6, 222),
 (7, 218),
 (8, 225),
 (9, 217),
 (10, 236)]

14. Identify the users who have memberships ending within a certain date range (in February 2025).

In [18]:
%%sql
SELECT 
    user_id, name, username, email_address, 
    renewal_status, devices_used, membership_start_date, membership_end_date
FROM amazon_prime
WHERE membership_end_date >= '2025-02-01' AND membership_end_date < '2025-03-01'
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[(5, 'Kathryn Brown', 'pattersonalexandra', 'pattersonalexandra@example.org', 'Auto-renew', 'Smart TV', datetime.datetime(2024, 2, 14, 0, 0), datetime.datetime(2025, 2, 13, 0, 0)),
 (8, 'James Smith', 'adrienne49', 'adrienne49@example.org', 'Manual', 'Smart TV', datetime.datetime(2024, 2, 16, 0, 0), datetime.datetime(2025, 2, 15, 0, 0)),
 (15, 'Melanie Burns', 'meyerstacy', 'meyerstacy@example.net', 'Manual', 'Smartphone', datetime.datetime(2024, 2, 23, 0, 0), datetime.datetime(2025, 2, 22, 0, 0)),
 (26, 'Kenneth Jones', 'glen97', 'glen97@example.net', 'Auto-renew', 'Smart TV', datetime.datetime(2024, 2, 12, 0, 0), datetime.datetime(2025, 2, 11, 0, 0)),
 (27, 'Joel Cole', 'nyates', 'nyates@example.com', 'Manual', 'Smart TV', datetime.datetime(2024, 2, 19, 0, 0), datetime.datetime(2025, 2, 18, 0, 0)),
 (31, 'Christopher Davis', 'urobinson', 'urobinson@example.net', 'Manual', 'Smartphone', datetime.datetime(2024, 2, 25, 0, 0), datetime.datetime(2025, 2, 24, 0, 0)),
 (37, 'Ryan Nunez', 'silvamichael', 'silvamichael@example.org', 'Auto-renew', 'Smart TV', datetime.datetime(2024, 2, 16, 0, 0), datetime.datetime(2025, 2, 15, 0, 0)),
 (40, 'Terry Powell', 'reyesjennifer', 'reyesjennifer@example.com', 'Auto-renew', 'Tablet', datetime.datetime(2024, 2, 4, 0, 0), datetime.datetime(2025, 2, 3, 0, 0)),
 (46, 'Geoffrey Garcia', 'benjamin76', 'benjamin76@example.org', 'Auto-renew', 'Smart TV', datetime.datetime(2024, 2, 3, 0, 0), datetime.datetime(2025, 2, 2, 0, 0)),
 (47, 'Jeffery Maxwell', 'debra51', 'debra51@example.org', 'Auto-renew', 'Smartphone', datetime.datetime(2024, 2, 21, 0, 0), datetime.datetime(2025, 2, 20, 0, 0))]

In [19]:
%%sql
WITH february_ending_records AS (
    SELECT 
    user_id, name, username, email_address, 
    renewal_status, devices_used, membership_start_date, membership_end_date
FROM amazon_prime
WHERE membership_end_date >= '2025-02-01' AND membership_end_date < '2025-03-01'
)
SELECT renewal_status, COUNT(user_id) AS total_users FROM february_ending_records
GROUP BY renewal_status;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
2 rows affected.

[('Auto-renew', 321), ('Manual', 312)]

In [20]:
%%sql
WITH february_ending_records AS (
    SELECT 
    user_id, name, username, email_address, 
    renewal_status, devices_used, membership_start_date, membership_end_date
FROM amazon_prime
WHERE membership_end_date >= '2025-02-01' AND membership_end_date < '2025-03-01'
)
SELECT devices_used, COUNT(user_id) AS total_users FROM february_ending_records
GROUP BY devices_used;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
3 rows affected.

[('Smart TV', 202), ('Smartphone', 235), ('Tablet', 196)]

15. List the users who have used a specific device (Tablet).

In [21]:
%%sql
SELECT 
    user_id, name, username, email_address, renewal_status
FROM amazon_prime
WHERE devices_used = 'Tablet'
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[(6, 'Sandra Cox', 'gparks', 'gparks@example.org', 'Manual'),
 (7, 'Benjamin Marshall', 'michaellewis', 'michaellewis@example.net', 'Auto-renew'),
 (10, 'Kayla Hernandez', 'jessica53', 'jessica53@example.net', 'Auto-renew'),
 (13, 'Kevin Mayo', 'hochoa', 'hochoa@example.net', 'Auto-renew'),
 (14, 'Gregory Thomas', 'egriffin', 'egriffin@example.com', 'Auto-renew'),
 (18, 'Mindy Baxter', 'phumphrey', 'phumphrey@example.net', 'Auto-renew'),
 (20, 'Joseph Owens', 'christopher25', 'christopher25@example.org', 'Manual'),
 (21, 'Devin Wolf', 'jacobrobinson', 'jacobrobinson@example.com', 'Manual'),
 (32, 'Rodney Jones', 'zfrost', 'zfrost@example.net', 'Manual'),
 (36, 'Carrie Smith', 'scottjohn', 'scottjohn@example.com', 'Manual')]

16. Calculate the total feedback or ratings given by users.

In [22]:
%%sql
SELECT username, ROUND(SUM(feedback_ratings), 2) AS total_ratings
FROM amazon_prime
GROUP BY username
ORDER BY total_ratings DESC LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[('scott11', 13.1),
 ('ewilson', 13.0),
 ('djohnson', 11.7),
 ('jeremy97', 9.8),
 ('bbell', 9.7),
 ('robert10', 9.6),
 ('panderson', 9.4),
 ('michaeljohnson', 9.3),
 ('jacqueline84', 9.2),
 ('ymartinez', 9.2)]

17. Get the usernames of users who have renewed their subscription.

In [23]:
%sql SELECT user_id, username, devices_used FROM amazon_prime WHERE renewal_status = 'Auto-Renew' LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[(4, 'elizabeth31', 'Smart TV'),
 (5, 'pattersonalexandra', 'Smart TV'),
 (7, 'michaellewis', 'Tablet'),
 (10, 'jessica53', 'Tablet'),
 (13, 'hochoa', 'Tablet'),
 (14, 'egriffin', 'Tablet'),
 (17, 'cday', 'Smartphone'),
 (18, 'phumphrey', 'Tablet'),
 (19, 'paige55', 'Smart TV'),
 (23, 'ronald82', 'Smart TV')]

18. Find the usernames of users who have not made any purchases.

In [24]:
%sql SELECT username FROM amazon_prime WHERE purchase_history IS NULL;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
0 rows affected.

[]

19. Identify the most frequently used device among users.

In [25]:
%%sql
WITH devices AS (
    SELECT devices_used AS device, COUNT(user_id) AS total_users FROM amazon_prime
    GROUP BY devices_used
)
SELECT device FROM devices WHERE total_users = (SELECT MAX(total_users) FROM devices);

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
1 rows affected.

[('Smartphone',)]

20. List the usernames and their corresponding locations for users who are highly engaged.

In [26]:
%%sql
SELECT name, username, location, devices_used AS device, favorite_genres AS genre
FROM amazon_prime
WHERE engagement_metrics = 'High' 
ORDER BY location
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
10 rows affected.

[('Edward Miller', 'jeffrey42', 'Aaronfort', 'Smart TV', 'Sci-Fi'),
 ('Elizabeth Carter', 'karen42', 'Aaronstad', 'Smartphone', 'Romance'),
 ('Ricky Hicks', 'dvasquez', 'Abigailton', 'Tablet', 'Sci-Fi'),
 ('Laura Martin', 'colelong', 'Adamfort', 'Smart TV', 'Sci-Fi'),
 ('John Bauer', 'amandamartin', 'Adrianborough', 'Smart TV', 'Sci-Fi'),
 ('Lisa Villarreal', 'brownjudith', 'Aguilarburgh', 'Smart TV', 'Drama'),
 ('James Roberts', 'samanthaparker', 'Aguilarshire', 'Tablet', 'Action'),
 ('Lance Patton', 'kristen45', 'Alejandroview', 'Smartphone', 'Horror'),
 ('Rachel Fields DVM', 'marilyn42', 'Alexisborough', 'Tablet', 'Documentary'),
 ('Vicki Bray', 'jasminematthews', 'Alishaburgh', 'Tablet', 'Comedy')]

In [27]:
%%sql
WITH high_engagement AS (
    SELECT name, username, location, devices_used AS device, favorite_genres AS genre
    FROM amazon_prime
    WHERE engagement_metrics = 'High' 
)
SELECT genre, COUNT(name) AS total_users FROM high_engagement GROUP BY genre;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
7 rows affected.

[('Documentary', 119),
 ('Drama', 122),
 ('Comedy', 124),
 ('Sci-Fi', 108),
 ('Horror', 130),
 ('Romance', 126),
 ('Action', 116)]

In [28]:
%%sql
WITH high_engagement AS (
    SELECT name, username, location, devices_used AS device, favorite_genres AS genre
    FROM amazon_prime
    WHERE engagement_metrics = 'High' 
)
SELECT device, COUNT(name) AS total_users FROM high_engagement GROUP BY device;

 * mysql+mysqlconnector://root:***@localhost:3306/apndatabase
3 rows affected.

[('Smart TV', 266), ('Tablet', 282), ('Smartphone', 297)]